app/controllers/sweets_controller.rb

SELECT "sweets".* FROM "sweets"
---
  def index
    @sweets = Sweet.all